get_together_app/app/controllers/application_controller.rb

SELECT  "manikins".* FROM "manikins" WHERE "manikins"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def current_manikin
        @current_manikin ||= Manikin.find(session[:manikin_id]) if session[:manikin_id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    def current_artist
        @current_artist ||= Artist.find(session[:artist_id]) if session[:artist_id]