get_together_app/app/controllers/artists_controller.rb

  def create
    @artist = Artist.create(artist_params)
---
INSERT INTO "artists" ("artist_name", "artist_type", "images", "phone", "location", "description", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 13]]

  def set_artist
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]