get_together_app/app/controllers/manikins_controller.rb

SELECT "manikins".* FROM "manikins"
---
  def index
    @manikins = Manikin.all

INSERT INTO "manikins" ("manikin_name", "manikin_type", "skin_tone", "skin_condition", "face_shape", "eye_color", "hair_color", "weight", "height", "date_of_birth", "gender", "bust", "waist", "hips", "shoes_size", "manikin_images", "phone", "location", "description", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23) RETURNING "id"
---
  def create
    @manikin = Manikin.create(manikin_params)

DELETE FROM "manikins" WHERE "manikins"."id" = $1  [["id", 5]]
---
  def destroy
    @manikin.destroy

SELECT  "manikins".* FROM "manikins" WHERE "manikins"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_manikin
    @manikin = Manikin.find(params[:id])