get_together_app/app/controllers/sessions_controller.rb

  def create
    @manikin = Manikin.find_by_email(params[:session][:email])
    @artist = Artist.find_by_email(params[:session][:email])
---
SELECT  "manikins".* FROM "manikins" WHERE "manikins"."email" = $1 LIMIT $2  [["email", "loo-ly@windowslive.com"], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."email" = $1 LIMIT $2  [["email", "loo-ly@windowslive.com"], ["LIMIT", 1]]